# Импорты


def main():
    warehouses = []
    current_warehouse = None
    while True:
        request = input('Что вы хотите сделать?')
        '''
        1 - Создать новый склад
        2 - Выбрать склад, с которым человек будет работать по его имени
        3 - Добавить товар на склад
        4 - Выкупить товар со склада
        5 - Посмотреть товары на складе отсортированные по общей стоимости
        6 - Проверить наличие товара на складе по его названию
        '''

        '''
        if request == '3':
            product = input('Кого хотите добавить, непродовольственный или продукт?')
            name = input как будет называться
            price = input какая стоимость
            amount = input в каком количестве
            если продукт то спросить про срок годности
            если непрод то спросить про срок гарантии
            добавить товар на склад
        '''


if __name__ == '__main__':
    main()
